In [5]:
import numpy as np
import pandas as pd

In [3]:
# string
country = ['India','Pakistan','USA','Nepal','Srilanka']

pd.Series(country)

0       India
1    Pakistan
2         USA
3       Nepal
4    Srilanka
dtype: object

In [5]:
# integers
runs = [13,24,56,78,100]

runs_ser = pd.Series(runs)

In [7]:
runs_ser

0     13
1     24
2     56
3     78
4    100
dtype: int64

In [7]:
# custom index
marks = [67,57,89,100]
subjects = ['maths','english','science','hindi']

pd.Series(marks,index=subjects)

maths       67
english     57
science     89
hindi      100
dtype: int64

In [9]:
# setting a name
marks = pd.Series(marks,index=subjects,name='Nitish ke marks')
marks

maths       67
english     57
science     89
hindi      100
Name: Nitish ke marks, dtype: int64

In [1]:
import numpy as np
import pandas as pd

In [7]:
a = pd.read_csv("C:/Users/hr51a/Downloads/datasets-session-16-20250425T030951Z-001/datasets-session-16/bollywood.csv")

In [9]:
a

                                     movie              lead
0                 Uri: The Surgical Strike     Vicky Kaushal
1                            Battalion 609       Vicky Ahuja
2     The Accidental Prime Minister (film)       Anupam Kher
3                          Why Cheat India     Emraan Hashmi
4                          Evening Shadows  Mona Ambegaonkar
...                                    ...               ...
1495                Hum Tumhare Hain Sanam    Shah Rukh Khan
1496                   Aankhen (2002 film)  Amitabh Bachchan
1497                       Saathiya (film)      Vivek Oberoi
1498                        Company (film)        Ajay Devgn
1499                  Awara Paagal Deewana      Akshay Kumar

[1500 rows x 2 columns]

In [11]:
a.head()

                                  movie              lead
0              Uri: The Surgical Strike     Vicky Kaushal
1                         Battalion 609       Vicky Ahuja
2  The Accidental Prime Minister (film)       Anupam Kher
3                       Why Cheat India     Emraan Hashmi
4                       Evening Shadows  Mona Ambegaonkar

In [13]:
a.tail()

                       movie              lead
1495  Hum Tumhare Hain Sanam    Shah Rukh Khan
1496     Aankhen (2002 film)  Amitabh Bachchan
1497         Saathiya (film)      Vivek Oberoi
1498          Company (film)        Ajay Devgn
1499    Awara Paagal Deewana      Akshay Kumar

In [15]:
a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   movie   1500 non-null   object
 1   lead    1500 non-null   object
dtypes: object(2)
memory usage: 23.6+ KB

In [17]:
a.shape

(1500, 2)

In [19]:
a.size

3000

In [21]:
a.isnull().sum()

movie    0
lead     0
dtype: int64

In [27]:
a.describe()

                          movie          lead
count                      1500          1500
unique                     1497           566
top     Tanu Weds Manu: Returns  Akshay Kumar
freq                          2            48

In [29]:
b = pd.read_csv("C:/Users/hr51a/Downloads/datasets-session-16-20250425T030951Z-001/datasets-session-16/kohli_ipl.csv")

In [31]:
b

     match_no  runs
0           1     1
1           2    23
2           3    13
3           4    12
4           5     1
..        ...   ...
210       211     0
211       212    20
212       213    73
213       214    25
214       215     7

[215 rows x 2 columns]

In [33]:
b.head()

   match_no  runs
0         1     1
1         2    23
2         3    13
3         4    12
4         5     1

In [35]:
b.tail()

     match_no  runs
210       211     0
211       212    20
212       213    73
213       214    25
214       215     7

In [37]:
b.shape

(215, 2)

In [39]:
b.size

430

In [41]:
b.isnull().sum()

match_no    0
runs        0
dtype: int64

In [45]:
b.describe()

         match_no        runs
count  215.000000  215.000000
mean   108.000000   30.855814
std     62.209324   26.229801
min      1.000000    0.000000
25%     54.500000    9.000000
50%    108.000000   24.000000
75%    161.500000   48.000000
max    215.000000  113.000000

In [47]:
c = pd.read_excel("C:/Users/hr51a/Downloads/datasets-session-16-20250425T030951Z-001/datasets-session-16/bollywood.xlsx")

In [49]:
c

                                     movie              lead
0                 Uri: The Surgical Strike     Vicky Kaushal
1                            Battalion 609       Vicky Ahuja
2     The Accidental Prime Minister (film)       Anupam Kher
3                          Why Cheat India     Emraan Hashmi
4                          Evening Shadows  Mona Ambegaonkar
...                                    ...               ...
1495                Hum Tumhare Hain Sanam    Shah Rukh Khan
1496                   Aankhen (2002 film)  Amitabh Bachchan
1497                       Saathiya (film)      Vivek Oberoi
1498                        Company (film)        Ajay Devgn
1499                  Awara Paagal Deewana      Akshay Kumar

[1500 rows x 2 columns]

In [5]:
import pandas as pd

# Create a simple DataFrame
df = pd.DataFrame({
    'Name': ['Ajit', 'Ravi', 'Simran'],
    'Age': [25, 30, 22]
}, index=['s1', 's2', 's3'])

In [7]:
df

      Name  Age
s1    Ajit   25
s2    Ravi   30
s3  Simran   22

In [9]:
df.loc['s2']

Name    Ravi
Age       30
Name: s2, dtype: object

In [11]:
df.loc['s1', 'Name']

'Ajit'

In [16]:
df.loc['s3', 'Age']

22

In [18]:
df.loc['s2', 'Age']

30

In [20]:
df.loc['s3', 'Name']

'Simran'

In [22]:
df.loc['s1':'s3']

      Name  Age
s1    Ajit   25
s2    Ravi   30
s3  Simran   22

In [26]:
df.iloc[1,0]

'Ravi'

In [28]:
df.iloc[0:,1]

s1    25
s2    30
s3    22
Name: Age, dtype: int64

In [32]:
df.iloc[0:2,0]

s1    Ajit
s2    Ravi
Name: Name, dtype: object

In [34]:
df.iloc[0,0]

'Ajit'

In [36]:
df.iloc[0:,0]

s1      Ajit
s2      Ravi
s3    Simran
Name: Name, dtype: object

In [40]:
import pandas as pd

data = {
    'Name': ['Ajit', 'Neha', 'Ravi', 'Simran'],
    'Age': [25, 24, 28, 22],
    'City': ['Delhi', 'Mumbai', 'Pune', 'Chennai']
}

df = pd.DataFrame(data, index=['s1', 's2', 's3', 's4'])
print(df)

      Name  Age     City
s1    Ajit   25    Delhi
s2    Neha   24   Mumbai
s3    Ravi   28     Pune
s4  Simran   22  Chennai

In [42]:
df

      Name  Age     City
s1    Ajit   25    Delhi
s2    Neha   24   Mumbai
s3    Ravi   28     Pune
s4  Simran   22  Chennai

In [ ]:
#DROPNA

In [1]:
import pandas as pd
import numpy as np

data = {
    'Name': ['Ajit', 'Neha', 'Ravi', None],
    'Age': [25, np.nan, 30, None],
    'City': ['Delhi', 'Mumbai', None, 'Pune']
}

df = pd.DataFrame(data)

In [3]:
df

   Name   Age    City
0  Ajit  25.0   Delhi
1  Neha   NaN  Mumbai
2  Ravi  30.0    None
3  None   NaN    Pune

In [5]:
df.dropna()

   Name   Age   City
0  Ajit  25.0  Delhi

In [7]:
df.dropna(how='all')

   Name   Age    City
0  Ajit  25.0   Delhi
1  Neha   NaN  Mumbai
2  Ravi  30.0    None
3  None   NaN    Pune

In [9]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [11]:
df.dropna(axis=0)

   Name   Age   City
0  Ajit  25.0  Delhi

In [15]:
df.dropna(subset=['Age'])

   Name   Age   City
0  Ajit  25.0  Delhi
2  Ravi  30.0   None

In [17]:
df.dropna(subset=['Name'])

   Name   Age    City
0  Ajit  25.0   Delhi
1  Neha   NaN  Mumbai
2  Ravi  30.0    None

In [19]:
df.dropna(subset=['City'])

   Name   Age    City
0  Ajit  25.0   Delhi
1  Neha   NaN  Mumbai
3  None   NaN    Pune

In [23]:
df.dropna(inplace=True)

In [25]:
df

   Name   Age   City
0  Ajit  25.0  Delhi

In [31]:
import pandas as pd
import numpy as np

data = {
    'Name': ['Ajit', 'Neha', 'Ravi', None],
    'Age': [25, np.nan, 30, None],
    'City': ['Delhi', 'Mumbai', None, 'Pune'],
    'Marks':[40,80,None,67],
    'Subjects':['English',None,'Accounts','Science']
}

df = pd.DataFrame(data)

In [33]:
df

   Name   Age    City  Marks  Subjects
0  Ajit  25.0   Delhi   40.0   English
1  Neha   NaN  Mumbai   80.0      None
2  Ravi  30.0    None    NaN  Accounts
3  None   NaN    Pune   67.0   Science

In [35]:
df.dropna()

   Name   Age   City  Marks Subjects
0  Ajit  25.0  Delhi   40.0  English

In [37]:
df.dropna(axis=0)

   Name   Age   City  Marks Subjects
0  Ajit  25.0  Delhi   40.0  English

In [39]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [41]:
df.dropna(subset=['Subjects'])

   Name   Age   City  Marks  Subjects
0  Ajit  25.0  Delhi   40.0   English
2  Ravi  30.0   None    NaN  Accounts
3  None   NaN   Pune   67.0   Science

In [43]:
df.dropna(subset=['Marks'])

   Name   Age    City  Marks Subjects
0  Ajit  25.0   Delhi   40.0  English
1  Neha   NaN  Mumbai   80.0     None
3  None   NaN    Pune   67.0  Science

In [45]:
df.dropna(subset=['Name'])

   Name   Age    City  Marks  Subjects
0  Ajit  25.0   Delhi   40.0   English
1  Neha   NaN  Mumbai   80.0      None
2  Ravi  30.0    None    NaN  Accounts

In [47]:
df.dropna(inplace = True)

In [49]:
df

   Name   Age   City  Marks Subjects
0  Ajit  25.0  Delhi   40.0  English

In [51]:
df.dropna(inplace = False)

   Name   Age   City  Marks Subjects
0  Ajit  25.0  Delhi   40.0  English

In [53]:
df

   Name   Age   City  Marks Subjects
0  Ajit  25.0  Delhi   40.0  English

In [2]:
import pandas as pd

In [18]:
d1 = pd.read_excel("C:/Users/hr51a/OneDrive/Documents/Data_1.xlsx")
d1

PermissionError: [Errno 13] Permission denied: 'C:/Users/hr51a/OneDrive/Documents/Data_1.xlsx'

In [24]:
d1 = pd.read_excel("C:/Users/hr51a/OneDrive/Documents/Data_1.xlsx")
d1

    Name    College  Marks   Subjects  CGPA
0   Arun  St Mary's   84.0        NaN   9.8
1  Vikas  Deshbandu   56.0      Maths   6.4
2  Raman  Ramanujan    NaN    Science   8.9
3    NaN      Nehru   75.0  Economics   NaN
4    Max        NaN   96.0   Accounts   7.3

In [38]:
d1.dropna(axis=0)

    Name    College  Marks Subjects  CGPA
1  Vikas  Deshbandu   56.0    Maths   6.4

In [40]:
d1.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [44]:
d1.dropna(subset=['College'])

    Name    College  Marks   Subjects  CGPA
0   Arun  St Mary's   84.0        NaN   9.8
1  Vikas  Deshbandu   56.0      Maths   6.4
2  Raman  Ramanujan    NaN    Science   8.9
3    NaN      Nehru   75.0  Economics   NaN

In [46]:
d1.dropna(subset='Name')

    Name    College  Marks  Subjects  CGPA
0   Arun  St Mary's   84.0       NaN   9.8
1  Vikas  Deshbandu   56.0     Maths   6.4
2  Raman  Ramanujan    NaN   Science   8.9
4    Max        NaN   96.0  Accounts   7.3

In [48]:
d1.dropna(subset='CGPA')

    Name    College  Marks  Subjects  CGPA
0   Arun  St Mary's   84.0       NaN   9.8
1  Vikas  Deshbandu   56.0     Maths   6.4
2  Raman  Ramanujan    NaN   Science   8.9
4    Max        NaN   96.0  Accounts   7.3

In [50]:
d1.dropna(inplace=True)

In [52]:
d1

    Name    College  Marks Subjects  CGPA
1  Vikas  Deshbandu   56.0    Maths   6.4

In [54]:
d1.dropna(inplace=False)

    Name    College  Marks Subjects  CGPA
1  Vikas  Deshbandu   56.0    Maths   6.4

In [56]:
d1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1 entries, 1 to 1
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      1 non-null      object
 1   College   1 non-null      object
 2   Marks     1 non-null      float64
 3   Subjects  1 non-null      object
 4   CGPA      1 non-null      float64
dtypes: float64(2), object(3)
memory usage: 48.0+ bytes

In [58]:
d1.head()

    Name    College  Marks Subjects  CGPA
1  Vikas  Deshbandu   56.0    Maths   6.4

In [60]:
d1.tail()

    Name    College  Marks Subjects  CGPA
1  Vikas  Deshbandu   56.0    Maths   6.4

In [66]:
d1.describe()

       Marks  CGPA
count    1.0   1.0
mean    56.0   6.4
std      NaN   NaN
min     56.0   6.4
25%     56.0   6.4
50%     56.0   6.4
75%     56.0   6.4
max     56.0   6.4

In [68]:
d1.isnull().sum()

Name        0
College     0
Marks       0
Subjects    0
CGPA        0
dtype: int64

In [5]:
import pandas as pd
d1 = pd.read_excel("C:/Users/hr51a/OneDrive/Documents/Data_1.xlsx")
d1

    Name    College  Marks   Subjects  CGPA
0   Arun  St Mary's   84.0        NaN   9.8
1  Vikas  Deshbandu   56.0      Maths   6.4
2  Raman  Ramanujan    NaN    Science   8.9
3    NaN      Nehru   75.0  Economics   NaN
4    Max        NaN   96.0   Accounts   7.3

In [7]:
d1

    Name    College  Marks   Subjects  CGPA
0   Arun  St Mary's   84.0        NaN   9.8
1  Vikas  Deshbandu   56.0      Maths   6.4
2  Raman  Ramanujan    NaN    Science   8.9
3    NaN      Nehru   75.0  Economics   NaN
4    Max        NaN   96.0   Accounts   7.3

In [9]:
d1.to_excel('xyz.xlsx',index=False)

In [11]:
d1

    Name    College  Marks   Subjects  CGPA
0   Arun  St Mary's   84.0        NaN   9.8
1  Vikas  Deshbandu   56.0      Maths   6.4
2  Raman  Ramanujan    NaN    Science   8.9
3    NaN      Nehru   75.0  Economics   NaN
4    Max        NaN   96.0   Accounts   7.3

In [14]:
import pandas as pd
d1 = pd.read_excel("C:/Users/hr51a/OneDrive/Documents/Data_1.xlsx")
d1

    Name    College  Marks   Subjects  CGPA
0   Arun  St Mary's   84.0        NaN   9.8
1  Vikas  Deshbandu   56.0      Maths   6.4
2  Raman  Ramanujan    NaN    Science   8.9
3    NaN      Nehru   75.0  Economics   NaN
4    Max        NaN   96.0   Accounts   7.3

In [18]:
d1.rename(columns={"Name":"Raman"})

   Raman    College  Marks   Subjects  CGPA
0   Arun  St Mary's   84.0        NaN   9.8
1  Vikas  Deshbandu   56.0      Maths   6.4
2  Raman  Ramanujan    NaN    Science   8.9
3    NaN      Nehru   75.0  Economics   NaN
4    Max        NaN   96.0   Accounts   7.3

In [20]:
d1.rename(columns={"College":"Nehru"})

    Name      Nehru  Marks   Subjects  CGPA
0   Arun  St Mary's   84.0        NaN   9.8
1  Vikas  Deshbandu   56.0      Maths   6.4
2  Raman  Ramanujan    NaN    Science   8.9
3    NaN      Nehru   75.0  Economics   NaN
4    Max        NaN   96.0   Accounts   7.3

In [22]:
d1.rename(columns={"Subjects":"Science"})

    Name    College  Marks    Science  CGPA
0   Arun  St Mary's   84.0        NaN   9.8
1  Vikas  Deshbandu   56.0      Maths   6.4
2  Raman  Ramanujan    NaN    Science   8.9
3    NaN      Nehru   75.0  Economics   NaN
4    Max        NaN   96.0   Accounts   7.3

In [24]:
d1.rename(columns={"Subjects":"Science","Name":"Raman","Marks":"Numbers","CGPA":"Grades"})

   Raman    College  Numbers    Science  Grades
0   Arun  St Mary's     84.0        NaN     9.8
1  Vikas  Deshbandu     56.0      Maths     6.4
2  Raman  Ramanujan      NaN    Science     8.9
3    NaN      Nehru     75.0  Economics     NaN
4    Max        NaN     96.0   Accounts     7.3

In [26]:
d1.columns = ['Names','School','Marks','Subjects','CGPA']

In [30]:
d1

   Names     School  Marks   Subjects  CGPA
0   Arun  St Mary's   84.0        NaN   9.8
1  Vikas  Deshbandu   56.0      Maths   6.4
2  Raman  Ramanujan    NaN    Science   8.9
3    NaN      Nehru   75.0  Economics   NaN
4    Max        NaN   96.0   Accounts   7.3

In [32]:
d1.rename(index={0:'A',1:'B'})

   Names     School  Marks   Subjects  CGPA
A   Arun  St Mary's   84.0        NaN   9.8
B  Vikas  Deshbandu   56.0      Maths   6.4
2  Raman  Ramanujan    NaN    Science   8.9
3    NaN      Nehru   75.0  Economics   NaN
4    Max        NaN   96.0   Accounts   7.3

In [38]:
d1.index = ['M','N','O','P','Q']

In [40]:
d1

   Names     School  Marks   Subjects  CGPA
M   Arun  St Mary's   84.0        NaN   9.8
N  Vikas  Deshbandu   56.0      Maths   6.4
O  Raman  Ramanujan    NaN    Science   8.9
P    NaN      Nehru   75.0  Economics   NaN
Q    Max        NaN   96.0   Accounts   7.3